{"changelogs": {

    "1.0-beta": {"date": "20 novembre 2020", "description": "- Un statut qui change de langue toute les minute (français, anglais, allemand et alsacien).\n- Un salon pour répertorier les arrivées et les départs du bot.\n- Une commande pour pouvoir changer la langue du bot parmi 4 (voir la liste : première ligne).\n- Une commande d’aide personnalisé.\n- Une commande pour faire des propositions sur le serveur du bot."},
    
    "2.0-beta": {"date": "27 novembre 2020", "description": "- FUSION DE 3 BOTS : N1ce-ban + Amanager (version 1.0) + The GIF BOT => ajout des commandes de modérations + commandes de recherche gifs avec Tenor.\n- Commandes pour que le bot puisse rejoindre et quitter un salon vocal, en développement.\n- Une commande d’aide qui catégorise les différentes aides en 4 autres commandes d’aide.\n- Reformulation de la méthode d’enregistrement des fichiers JSON.\n- Suppression de la fonction multilingue, le français réside. (Le bot multilingue est enregistré mais plus disponible sur Discord.)\n- Une whitelist de salons textuels pour l’auto-réaction quand le déclencheur « [APOD] » est envoyé dans un salon pour APOD.\n- Un auto-réaction pour le salon #propositions du serveur du bot.\n- Changement des messages écrits dans le statut du bot."},
    
    "2.1-beta": {"date": "4 décembre 2020", "description": "- Ajout d'une petite commande help à chaque commande (sauf pour les commandes d'aides).\n- Une commande 'hexsearch' pour visualiser une couleur avec son code hexadécimal.\n- Toutes les commandes ont été ré-adaptées pour fonctionner dans la partie 'on_message' et plus avec des décorateurs '@bot.command', ce qui permet d'avoir une commande **setprefix** (voir **setprefix help** pour plus d'infos)."},
    
    "2.2-beta": {"date": "11 décembre 2020", "description": "- En développement : des commandes en rapport avec les statistiques du COVID-19.\n- Le retour de la fonction multilingue : 2 langues seulement sont à l’affiche (Français & Anglais).\n- Ajout de la commande ‘meme’ qui génère un meme aléatoire grâce au site Reddit.\n- Des commandes ‘coinflip’ & ‘roll’ qui permettent de lancer, virtuellement, une pièce et un dé.\n- Traduction partielle de la partie anglaise : commandes help (39 commandes help)."},
    
    "2.3-beta": {"date": "18 décembre 2020", "description": "- Ajout de nouveaux statuts.\n- D’un message qui annonce les statistiques (nombre de serveurs dans lequel est le bot, …) et qui s’auto-update.\n- Activation de commandes en fonction de la date à laquelle on est.\n- Suppression des commandes d’aides par thème, centralisation dans une seule commande principale.\n- Ajout d’énormément d’alias, comme **+h** et **+aide** pour la commande d’aide principale.\n- D’une commande qui envoie l’APOD de la NASA.\n- De la commande ‘bugreport’ qui permet de signaler un bug depuis n’importe quel serveur, envoyé directement sur le serveur du bot !\n- De la commande ‘utc’ qui permet de voir l’heure des 24 fuseaux horaires et l’heure dans chaque ville. (La 2e fonctionnalité est cependant très limitée.)\n- De 2 commandes pour pouvoir générer des photos de chiens & chats.\n- :heart: La commande ‘+remerciements’ est dédiée à toutes les personnes qui ont contribué à ce bot (testeurs & ceux qui ont donné des idées), merci à eux !"},
    
    "2.4-beta": {"date": "1 janvier 2021", "description": "Le changelog est trop long pour être envoyé dans un message Discord, le voici donc : https://pastebin.com/raw/cfFTUFWj"},

    "3.0-beta": {"date": "30 janvier 2021", "description": "- Réécriture TOTALE du bot avec une séparation concrète entre chaque commande (ce qui permet une meilleure lisibilité du code).\n- Choix aléatoire de service dans la commande ‘shorten’ quand aucun service n’est spécifié.\n- Les commandes ‘afk’, ‘setprefix’ et ‘resetprefix’ sont momentanément désactivées.\n- La commande ‘redpanda’ a été retirée car l’API dont je me servais est hors service. Si vous connaissez une API qui permet d’envoyer des images de panda roux, vous pouvez me contacter sur le serveur support ! (Pour le rejoindre : **+invite server**)"},
    
    "3.0.1-beta": {"date": "5 février 2021", "description": "- Ajout du nombre de commandes dans la commande ‘help’ (avec le nombre total et le nombre auxquelles vous avez accès).\n- D’une image dans la commande ‘weather’ qui change en fonction de la météo de la ville entrée."},
    
    "3.0.2-beta": {"date": "12 février 2021", "description": "- Ajout de la commande Wikipédia\nDe la section « Économie », avec :\n- La commande ‘card’ pour voir ses informations dans la section Economie.\n- La commande ‘rep’ pour donner un point de réputation à quelqu’un (cooldown de 6 heures)."},

    "3.0.3-beta": {"date": "19 février 2021", "description": "- Conversion des commandes avec décorateur **@commands.cog.Listener**, en commandes avec décorateur **@commands.command()**.\n- Accès aux changelogs disponible grâce à une API disponible sur mon site ! (https://fr.iso-land.org/api)\n- Bug fixé de la commande **pwd** : quand on demandais de n’avoir ni des chiffres, ni des caractères, ça ne générait pas la bonne longueur de mot de passe.\n- Ajout de la commande **poll** qui permet de faire des sondages, jusqu’à 10 réponses possibles (avec entête) !"},

    "3.1-beta": {"date": "26 février 2021", "description": "__Ajouts :__\n- La commande ‘birthday’ dans la catégorie Role-Play.\n- La commande **poll end** permettant d’afficher les résultats d’un sondage.\n- Les commandes **afk**, **color** (anciennement appelée hexsearch), **encode**, **decode** et **say** sont de retour !\n- Les commandes **top rep** et **top daily** pour voir les membres qui ont le plus de points de réputation, et le plus de crédits.\n- La commande **daily** pour récupérer de l’argent quotidiennement.\n- Une partie **succès** dans la commande **card**.\n- Des succès concernant les points de réputation.\n- Une commande starboard, disponible sur tous les serveurs.\n- Création de bases de données sqlite3. \n\n__Editions :__\n- La commande **mcstats** a été mise à jour : on peut maintenant voir ces statistiques avec une image !\n- La commande **help** a été repensée, la commande **commands** a été ajoutée en complément d’aide.\n- Modification de l’API des changelogs : ajout d’une date pour chaque version.\n\n__Autres :__\n- Allègement de certaines commandes."},

    "3.1.1-beta": {"date": "5 mars 2021", "description": "__Ajouts :__\n- La commande **remindme** qui permet d’organiser un rappel (commande très basique).\n- Commande **settings** avec la commande starboard qui y réside désormais.\n- Système de points d’expérience auto-incrémental différent entre chaque serveur.\n- Système de niveaux liés aux points d’expérience. Possibilité de changer le message de passage au niveau supérieur (disponible également dans la commande **settings**).\n- Points d’expérience et niveaux dans la commande **top**.\n- La commande **give** qui permet de donner de l’argent à un membre qui est sur le même serveur (avec une petite taxe 😜).\n\n__Editions :__\n- Les statuts changeants (il y en a moins).\n- Le bot ne compte, désormais, plus ses votes dans la commande de sondage."},

    "3.1.2-beta": {"date": "12 mars 2021", "description": "__Ajouts :__\n- Informations à propos des paramètres du bot disponible dans la commande **settings**. \n- La commande **work** qui permet de travailler pour gagner plus de crédits (cooldown de 24h).\n- Du travail (bêta) et d'un emoji changeant en fonction du travail sur la aCard.\n- La commande 'inventory' qui permet d'afficher son inventaire (bêta).\n- Limites dans la commande **rng**, qui sont de [-4294967296 ; 4294967296].\n- Un message est envoyé quand une commande est entrée mais non-reconnue.\n- Un système automatisé de limitation de crédits, permettant l'ajout de métiers facilement (il manque le solde de départ à configurer).\n\n__Editions :__\n- Un bug de la commande **rng** qui empêchait de générer un nombre aléatoire quand l’intervalle était trop grande a été réglé.\n- Un bug a été réglé dans les commandes qui nécessitaient un cooldown propre à l'utilisateur : désormais, les utilisateurs ne peuvent plus utiliser une commande sur plusieurs serveurs en même temps pour surpasser la limite du cooldown.\n\n__Autres :__\n- Un nouveau contributeur a été ajouté dans la commande 'remerciements' : MAKI, le créateur de la photo de profil du discord ISO land ! Merci beaucoup à lui !"},
    
    "3.1.3-beta": {"date": "19 mars 2021", "description": "__Ajouts :__\n- Une commande **achievement** pour afficher ses succès. (L'ancienne commande **achievement** de Minecraft s'appelle maintenant **mcachievement** !)\n- Un système de messages d'arrivée/de départs de membres : vous pouvez désormais faire envoyer un message dans un salon dès qu'un membre rejoins/quitte votre serveur !\n- Une commande **me** pour 'mimer' une action à l'écrit.\n- Une limite dans les niveaux, qui est de 100. Au de-là de ce niveau, votre expérience ne progresse plus et vous avez un emoji **infini** qui remplace le niveau auquel vous êtes.\n\n__Editions :__\n- Modification de certains paramètres dans la commande **settings**."}
    }}